apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.h
#ifdef CONFIG_STM32_LPTIM1_CHANNEL1
#  ifdef CONFIG_STM32_LPTIM1_CH1OUT
#    define PWM_LPTIM1_CH1CFG GPIO_LPTIM1_CH1OUT
#  else
#    define PWM_LPTIM1_CH1CFG 0
#  endif
#  ifdef CONFIG_STM32_LPTIM1_CH1NOUT
#    define PWM_LPTIM1_CH1NCFG GPIO_LPTIM1_CH1NOUT
#  else
#    define PWM_LPTIM1_CH1NCFG 0
#  endif
#  define PWM_LPTIM1_CHANNEL1 1
#else
#  define PWM_LPTIM1_CHANNEL1 0
#endif
#define PWM_LPTIM1_NCHANNELS PWM_LPTIM1_CHANNEL1

#ifdef CONFIG_STM32_LPTIM2_CHANNEL1
#  ifdef CONFIG_STM32_LPTIM2_CH1OUT
#    define PWM_LPTIM2_CH1CFG GPIO_LPTIM2_CH1OUT
#  else
#    define PWM_LPTIM2_CH1CFG 0
#  endif
#  ifdef CONFIG_STM32_LPTIM2_CH1NOUT
#    define PWM_LPTIM2_CH1NCFG GPIO_LPTIM2_CH1NOUT
#  else
#    define PWM_LPTIM2_CH1NCFG 0
#  endif
#  define PWM_LPTIM2_CHANNEL1 1
#else
#  define PWM_LPTIM2_CHANNEL1 0
#endif
#define PWM_LPTIM2_NCHANNELS PWM_LPTIM2_CHANNEL1

#else /* !CONFIG_STM32_PWM_MULTICHAN */

/* For each timer that is enabled for PWM usage, we need the following
 * additional configuration settings:
 *
 * CONFIG_STM32_TIMx_CHANNEL - Specifies the timer output channel
 * {1,..,4}
 * PWM_TIMx_CHn - One of the values defined in chip/stm32*_pinmap.h.
 *   In the case where there are multiple pin selections, the correct
 *   setting must be provided in the arch/board/board.h file.
 *
 * NOTE:
 * The STM32L4 timers are each capable of generating different signals
 * on each of the four channels with different duty cycles.  That
 * capability is not supported by this driver:
 *  Only one output channel per timer.
 */

#ifdef CONFIG_STM32_TIM1_PWM
#  if !defined(CONFIG_STM32_TIM1_CHANNEL)
#    error "CONFIG_STM32_TIM1_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM1_CHANNEL == 1
#    define CONFIG_STM32_TIM1_CHANNEL1 1
#    define CONFIG_STM32_TIM1_CH1MODE  CONFIG_STM32_TIM1_CHMODE
#    ifdef CONFIG_STM32_TIM1_CH1OUT
#      define PWM_TIM1_CH1CFG            GPIO_TIM1_CH1OUT
#    endif
#    ifdef CONFIG_STM32_TIM1_CH1NOUT
#      define PWM_TIM1_CH1NCFG           GPIO_TIM1_CH1NOUT
#    else
#      define PWM_TIM1_CH1NCFG           0
#    endif
#  elif CONFIG_STM32_TIM1_CHANNEL == 2
#    define CONFIG_STM32_TIM1_CHANNEL2 1
#    define CONFIG_STM32_TIM1_CH2MODE  CONFIG_STM32_TIM1_CHMODE
#    ifdef CONFIG_STM32_TIM1_CH2OUT
#      define PWM_TIM1_CH2CFG            GPIO_TIM1_CH2OUT
#    endif
#    ifdef CONFIG_STM32_TIM1_CH2NOUT
#      define PWM_TIM1_CH2NCFG           GPIO_TIM1_CH2NOUT
#    else
#      define PWM_TIM1_CH2NCFG           0
#    endif
#  elif CONFIG_STM32_TIM1_CHANNEL == 3
#    define CONFIG_STM32_TIM1_CHANNEL3 1
#    define CONFIG_STM32_TIM1_CH3MODE  CONFIG_STM32_TIM1_CHMODE
#    ifdef CONFIG_STM32_TIM1_CH3OUT
#      define PWM_TIM1_CH3CFG            GPIO_TIM1_CH3OUT
#    endif
#    ifdef CONFIG_STM32_TIM1_CH3NOUT
#      define PWM_TIM1_CH3NCFG           GPIO_TIM1_CH3NOUT
#    else
#      define PWM_TIM1_CH3NCFG           0
#    endif
#  elif CONFIG_STM32_TIM1_CHANNEL == 4
#    define CONFIG_STM32_TIM1_CHANNEL4 1
#    define CONFIG_STM32_TIM1_CH4MODE  CONFIG_STM32_TIM1_CHMODE
#    ifdef CONFIG_STM32_TIM1_CH4OUT
#      define PWM_TIM1_CH4CFG            GPIO_TIM1_CH4OUT
#    endif
#  else
#    error "Unsupported value of CONFIG_STM32_TIM1_CHANNEL"
#  endif
#  define PWM_TIM1_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_TIM2_PWM
#  if !defined(CONFIG_STM32_TIM2_CHANNEL)
#    error "CONFIG_STM32_TIM2_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM2_CHANNEL == 1
#    define CONFIG_STM32_TIM2_CHANNEL1 1
#    define CONFIG_STM32_TIM2_CH1MODE  CONFIG_STM32_TIM2_CHMODE
#    define PWM_TIM2_CH1CFG            GPIO_TIM2_CH1OUT
#  elif CONFIG_STM32_TIM2_CHANNEL == 2
#    define CONFIG_STM32_TIM2_CHANNEL2 1
#    define CONFIG_STM32_TIM2_CH2MODE  CONFIG_STM32_TIM2_CHMODE
#    define PWM_TIM2_CH2CFG            GPIO_TIM2_CH2OUT
#  elif CONFIG_STM32_TIM2_CHANNEL == 3
#    define CONFIG_STM32_TIM2_CHANNEL3 1
#    define CONFIG_STM32_TIM2_CH3MODE  CONFIG_STM32_TIM2_CHMODE
#    define PWM_TIM2_CH3CFG            GPIO_TIM2_CH3OUT
#  elif CONFIG_STM32_TIM2_CHANNEL == 4
#    define CONFIG_STM32_TIM2_CHANNEL4 1
#    define CONFIG_STM32_TIM2_CH4MODE  CONFIG_STM32_TIM2_CHMODE
#    define PWM_TIM2_CH4CFG            GPIO_TIM2_CH4OUT
#  else
#    error "Unsupported value of CONFIG_STM32_TIM2_CHANNEL"
#  endif
#  define PWM_TIM2_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_TIM3_PWM
#  if !defined(CONFIG_STM32_TIM3_CHANNEL)
#    error "CONFIG_STM32_TIM3_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM3_CHANNEL == 1
#    define CONFIG_STM32_TIM3_CHANNEL1 1
#    define CONFIG_STM32_TIM3_CH1MODE  CONFIG_STM32_TIM3_CHMODE
#    define PWM_TIM3_CH1CFG            GPIO_TIM3_CH1OUT
#  elif CONFIG_STM32_TIM3_CHANNEL == 2
#    define CONFIG_STM32_TIM3_CHANNEL2 1
#    define CONFIG_STM32_TIM3_CH2MODE  CONFIG_STM32_TIM3_CHMODE
#    define PWM_TIM3_CH2CFG            GPIO_TIM3_CH2OUT
#  elif CONFIG_STM32_TIM3_CHANNEL == 3
#    define CONFIG_STM32_TIM3_CHANNEL3 1
#    define CONFIG_STM32_TIM3_CH3MODE  CONFIG_STM32_TIM3_CHMODE
#    define PWM_TIM3_CH3CFG            GPIO_TIM3_CH3OUT
#  elif CONFIG_STM32_TIM3_CHANNEL == 4
#    define CONFIG_STM32_TIM3_CHANNEL4 1
#    define CONFIG_STM32_TIM3_CH4MODE  CONFIG_STM32_TIM3_CHMODE
#    define PWM_TIM3_CH4CFG            GPIO_TIM3_CH4OUT
#  else
#    error "Unsupported value of CONFIG_STM32_TIM3_CHANNEL"
#  endif
#  define PWM_TIM3_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_TIM4_PWM
#  if !defined(CONFIG_STM32_TIM4_CHANNEL)
#    error "CONFIG_STM32_TIM4_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM4_CHANNEL == 1
#    define CONFIG_STM32_TIM4_CHANNEL1 1
#    define CONFIG_STM32_TIM4_CH1MODE  CONFIG_STM32_TIM4_CHMODE
#    define PWM_TIM4_CH1CFG            GPIO_TIM4_CH1OUT
#  elif CONFIG_STM32_TIM4_CHANNEL == 2
#    define CONFIG_STM32_TIM4_CHANNEL2 1
#    define CONFIG_STM32_TIM4_CH2MODE  CONFIG_STM32_TIM4_CHMODE
#    define PWM_TIM4_CH2CFG            GPIO_TIM4_CH2OUT
#  elif CONFIG_STM32_TIM4_CHANNEL == 3
#    define CONFIG_STM32_TIM4_CHANNEL3 1
#    define CONFIG_STM32_TIM4_CH3MODE  CONFIG_STM32_TIM4_CHMODE
#    define PWM_TIM4_CH3CFG            GPIO_TIM4_CH3OUT
#  elif CONFIG_STM32_TIM4_CHANNEL == 4
#    define CONFIG_STM32_TIM4_CHANNEL4 1
#    define CONFIG_STM32_TIM4_CH4MODE  CONFIG_STM32_TIM4_CHMODE
#    define PWM_TIM4_CH4CFG            GPIO_TIM4_CH4OUT
#  else
#    error "Unsupported value of CONFIG_STM32_TIM4_CHANNEL"
#  endif
#  define PWM_TIM4_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_TIM5_PWM
#  if !defined(CONFIG_STM32_TIM5_CHANNEL)
#    error "CONFIG_STM32_TIM5_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM5_CHANNEL == 1
#    define CONFIG_STM32_TIM5_CHANNEL1 1
#    define CONFIG_STM32_TIM5_CH1MODE  CONFIG_STM32_TIM5_CHMODE
#    define PWM_TIM5_CH1CFG            GPIO_TIM5_CH1OUT
#  elif CONFIG_STM32_TIM5_CHANNEL == 2
#    define CONFIG_STM32_TIM5_CHANNEL2 1
#    define CONFIG_STM32_TIM5_CH2MODE  CONFIG_STM32_TIM5_CHMODE
#    define PWM_TIM5_CH2CFG            GPIO_TIM5_CH2OUT
#  elif CONFIG_STM32_TIM5_CHANNEL == 3
#    define CONFIG_STM32_TIM5_CHANNEL3 1
#    define CONFIG_STM32_TIM5_CH3MODE  CONFIG_STM32_TIM5_CHMODE
#    define PWM_TIM5_CH3CFG            GPIO_TIM5_CH3OUT
#  elif CONFIG_STM32_TIM5_CHANNEL == 4
#    define CONFIG_STM32_TIM5_CHANNEL4 1
#    define CONFIG_STM32_TIM5_CH4MODE  CONFIG_STM32_TIM5_CHMODE
#    define PWM_TIM5_CH4CFG            GPIO_TIM5_CH4OUT
#  else
#    error "Unsupported value of CONFIG_STM32_TIM5_CHANNEL"
#  endif
#  define PWM_TIM5_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_TIM8_PWM
#  if !defined(CONFIG_STM32_TIM8_CHANNEL)
#    error "CONFIG_STM32_TIM8_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM8_CHANNEL == 1
#    define CONFIG_STM32_TIM8_CHANNEL1 1
#    define CONFIG_STM32_TIM8_CH1MODE  CONFIG_STM32_TIM8_CHMODE
#    define PWM_TIM8_CH1CFG            GPIO_TIM8_CH1OUT
#    define PWM_TIM8_CH1NCFG           0
#  elif CONFIG_STM32_TIM8_CHANNEL == 2
#    define CONFIG_STM32_TIM8_CHANNEL2 1
#    define CONFIG_STM32_TIM8_CH2MODE  CONFIG_STM32_TIM8_CHMODE
#    define PWM_TIM8_CH2CFG            GPIO_TIM8_CH2OUT
#    define PWM_TIM8_CH2NCFG           0
#  elif CONFIG_STM32_TIM8_CHANNEL == 3
#    define CONFIG_STM32_TIM8_CHANNEL3 1
#    define CONFIG_STM32_TIM8_CH3MODE  CONFIG_STM32_TIM8_CHMODE
#    define PWM_TIM8_CH3CFG            GPIO_TIM8_CH3OUT
#    define PWM_TIM8_CH3NCFG           0
#  elif CONFIG_STM32_TIM8_CHANNEL == 4
#    define CONFIG_STM32_TIM8_CHANNEL4 1
#    define CONFIG_STM32_TIM8_CH4MODE  CONFIG_STM32_TIM8_CHMODE
#    define PWM_TIM8_CH4CFG            GPIO_TIM8_CH4OUT
#  else
#    error "Unsupported value of CONFIG_STM32_TIM8_CHANNEL"
#  endif
#  define PWM_TIM8_NCHANNELS 1
#endif

