apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.h
#ifdef CONFIG_STM32_TIM15_PWM
#  if !defined(CONFIG_STM32_TIM15_CHANNEL)
#    error "CONFIG_STM32_TIM15_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM15_CHANNEL == 1
#    define CONFIG_STM32_TIM15_CHANNEL1 1
#    define CONFIG_STM32_TIM15_CH1MODE  CONFIG_STM32_TIM15_CHMODE
#    define PWM_TIM15_CH1CFG            GPIO_TIM15_CH1OUT
#    define PWM_TIM15_CH1NCFG           0
#  elif CONFIG_STM32_TIM15_CHANNEL == 2
#    define CONFIG_STM32_TIM15_CHANNEL2 1
#    define CONFIG_STM32_TIM15_CH2MODE  CONFIG_STM32_TIM15_CHMODE
#    define PWM_TIM15_CH2CFG            GPIO_TIM15_CH2OUT
#  else
#    error "Unsupported value of CONFIG_STM32_TIM15_CHANNEL"
#  endif
#  define PWM_TIM15_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_TIM16_PWM
#  if !defined(CONFIG_STM32_TIM16_CHANNEL)
#    error "CONFIG_STM32_TIM16_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM16_CHANNEL == 1
#    define CONFIG_STM32_TIM16_CHANNEL1 1
#    define CONFIG_STM32_TIM16_CH1MODE  CONFIG_STM32_TIM16_CHMODE
#    define PWM_TIM16_CH1CFG            GPIO_TIM16_CH1OUT
#    define PWM_TIM16_CH1NCFG           0
#  else
#    error "Unsupported value of CONFIG_STM32_TIM16_CHANNEL"
#  endif
#  define PWM_TIM16_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_TIM17_PWM
#  if !defined(CONFIG_STM32_TIM17_CHANNEL)
#    error "CONFIG_STM32_TIM17_CHANNEL must be provided"
#  elif CONFIG_STM32_TIM17_CHANNEL == 1
#    define CONFIG_STM32_TIM17_CHANNEL1 1
#    define CONFIG_STM32_TIM17_CH1MODE  CONFIG_STM32_TIM17_CHMODE
#    define PWM_TIM17_CH1CFG            GPIO_TIM17_CH1OUT
#    define PWM_TIM17_CH1NCFG           0
#  else
#    error "Unsupported value of CONFIG_STM32_TIM17_CHANNEL"
#  endif
#  define PWM_TIM17_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_LPTIM1_PWM
#  if !defined(CONFIG_STM32_LPTIM1_CHANNEL)
#    error "CONFIG_STM32_LPTIM1_CHANNEL must be provided"
#  elif CONFIG_STM32_LPTIM1_CHANNEL == 1
#    define CONFIG_STM32_LPTIM1_CHANNEL1  1
#    define PWM_LPTIM1_CH1CFG               GPIO_LPTIM1_CH1OUT
#    define PWM_LPTIM1_CH1NCFG              0
#  else
#    error "Unsupported value of CONFIG_STM32_LPTIM1_CHANNEL"
#  endif
#  define PWM_LPTIM1_NCHANNELS 1
#endif

#ifdef CONFIG_STM32_LPTIM2_PWM
#  if !defined(CONFIG_STM32_LPTIM2_CHANNEL)
#    error "CONFIG_STM32_LPTIM2_CHANNEL must be provided"
#  elif CONFIG_STM32_LPTIM2_CHANNEL == 1
#    define CONFIG_STM32_LPTIM2_CHANNEL1  1
#    define PWM_LPTIM2_CH1CFG               GPIO_LPTIM2_CH1OUT
#    define PWM_LPTIM2_CH1NCFG              0
#  else
#    error "Unsupported value of CONFIG_STM32_LPTIM2_CHANNEL"
#  endif
#  define PWM_LPTIM2_NCHANNELS 1
#endif

#endif

/* Complementary outputs support */

#if defined(CONFIG_STM32_TIM1_CH1NOUT) || defined(CONFIG_STM32_TIM1_CH2NOUT) || \
    defined(CONFIG_STM32_TIM1_CH3NOUT)
#  define HAVE_TIM1_COMPLEMENTARY
#endif
#if defined(CONFIG_STM32_TIM8_CH1NOUT) || defined(CONFIG_STM32_TIM8_CH2NOUT) || \
    defined(CONFIG_STM32_TIM8_CH3NOUT)
#  define HAVE_TIM8_COMPLEMENTARY
#endif
#if defined(CONFIG_STM32_TIM15_CH1NOUT)
#  define HAVE_TIM15_COMPLEMENTARY
#endif
#if defined(CONFIG_STM32_TIM16_CH1NOUT)
#  define HAVE_TIM16_COMPLEMENTARY
#endif
#if defined(CONFIG_STM32_TIM17_CH1NOUT)
#  define HAVE_TIM17_COMPLEMENTARY
#endif
#if defined(CONFIG_STM32_LPTIM1_CH1NOUT)
#  define HAVE_LPTIM1_COMPLEMENTARY
#endif
#if defined(CONFIG_STM32_LPTIM2_CH1NOUT)
#  define HAVE_LPTIM2_COMPLEMENTARY
#endif
#if defined(HAVE_TIM1_COMPLEMENTARY) || defined(HAVE_TIM8_COMPLEMENTARY) ||   \
    defined(HAVE_TIM15_COMPLEMENTARY) || defined(HAVE_TIM16_COMPLEMENTARY) || \
    defined(HAVE_TIM17_COMPLEMENTARY) || defined(HAVE_LPTIM1_COMPLEMENTARY) || \
    defined(HAVE_LPTIM2_COMPLEMENTARY)
#  define HAVE_PWM_COMPLEMENTARY
#endif

/* Low-level ops helpers ****************************************************/

#ifdef CONFIG_STM32_PWM_LL_OPS

/* NOTE: low-level ops accept pwm_lowerhalf_s as first argument, but llops
 *       access can be found in stm32_pwm_dev_s
 */

#define PWM_SETUP(dev)                                                             \
        (dev)->ops->setup((struct pwm_lowerhalf_s *)dev)
#define PWM_SHUTDOWN(dev)                                                          \
        (dev)->ops->shutdown((struct pwm_lowerhalf_s *)dev)
#define PWM_CCR_UPDATE(dev, index, ccr)                                            \
        (dev)->llops->ccr_update((struct pwm_lowerhalf_s *)dev, index, ccr)
#define PWM_MODE_UPDATE(dev, index, mode)                                          \
        (dev)->llops->mode_update((struct pwm_lowerhalf_s *)dev, index, mode)
#define PWM_CCR_GET(dev, index)                                                    \
        (dev)->llops->ccr_get((struct pwm_lowerhalf_s *)dev, index)
#define PWM_ARR_UPDATE(dev, arr)                                                   \
        (dev)->llops->arr_update((struct pwm_lowerhalf_s *)dev, arr)
#define PWM_ARR_GET(dev)                                                           \
        (dev)->llops->arr_get((struct pwm_lowerhalf_s *)dev)
#define PWM_OUTPUTS_ENABLE(dev, out, state)                                        \
        (dev)->llops->outputs_enable((struct pwm_lowerhalf_s *)dev, out, state)
#define PWM_SOFT_UPDATE(dev)                                                       \
        (dev)->llops->soft_update((struct pwm_lowerhalf_s *)dev)
#define PWM_CONFIGURE(dev)                                                         \
        (dev)->llops->configure((struct pwm_lowerhalf_s *)dev)
#define PWM_SOFT_BREAK(dev, state)                                                 \
        (dev)->llops->soft_break((struct pwm_lowerhalf_s *)dev, state)
#define PWM_FREQ_UPDATE(dev, freq)                                                 \
        (dev)->llops->freq_update((struct pwm_lowerhalf_s *)dev, freq)
#define PWM_TIM_ENABLE(dev, state)                                                 \
        (dev)->llops->tim_enable((struct pwm_lowerhalf_s *)dev, state)
#ifdef CONFIG_DEBUG_STM32_PWM_INFO
#  define PWM_DUMP_REGS(dev, msg)                                                  \
        (dev)->llops->dump_regs((struct pwm_lowerhalf_s *)dev, msg)
#else
#  define PWM_DUMP_REGS(dev, msg)
#endif
#define PWM_DT_UPDATE(dev, dt)                                                     \
        (dev)->llops->dt_update((struct pwm_lowerhalf_s *)dev, dt)
#endif

/****************************************************************************
 * Public Types
 ****************************************************************************/

/* Timer mode */

enum stm32_timmode_e
{
  STM32_TIMMODE_COUNTUP   = 0,
  STM32_TIMMODE_COUNTDOWN = 1,
  STM32_TIMMODE_CENTER1   = 2,
  STM32_TIMMODE_CENTER2   = 3,
  STM32_TIMMODE_CENTER3   = 4,
};

/* Timer output polarity */

enum stm32_pwm_pol_e
{
  STM32_POL_POS  = 0,
  STM32_POL_NEG  = 1,
};

/* Timer output IDLE state */

enum stm32_pwm_idle_e
{
  STM32_IDLE_INACTIVE = 0,
  STM32_IDLE_ACTIVE   = 1
};

/* PWM channel mode */

enum stm32_chanmode_e
{
  STM32_CHANMODE_FRZN        = 0,  /* CCRx matches has no effects on outputs */
  STM32_CHANMODE_CHACT       = 1,  /* OCxREF active on match */
  STM32_CHANMODE_CHINACT     = 2,  /* OCxREF inactive on match */
  STM32_CHANMODE_OCREFTOG    = 3,  /* OCxREF toggles when TIMy_CNT=TIMyCCRx */
  STM32_CHANMODE_OCREFLO     = 4,  /* OCxREF is forced low */
  STM32_CHANMODE_OCREFHI     = 5,  /* OCxREF is forced high */
  STM32_CHANMODE_PWM1        = 6,  /* PWM mode 1 */
  STM32_CHANMODE_PWM2        = 7,  /* PWM mode 2 */
  STM32_CHANMODE_COMBINED1   = 8,  /* Combined PWM mode 1 */
  STM32_CHANMODE_COMBINED2   = 9,  /* Combined PWM mode 2 */
  STM32_CHANMODE_ASYMMETRIC1 = 10, /* Asymmetric PWM mode 1 */
  STM32_CHANMODE_ASYMMETRIC2 = 11, /* Asymmetric PWM mode 2 */
};

/* PWM timer channel */

enum stm32_pwm_chan_e
{
  STM32_PWM_CHAN1  = 1,
  STM32_PWM_CHAN2  = 2,
  STM32_PWM_CHAN3  = 3,
  STM32_PWM_CHAN4  = 4,
  STM32_PWM_CHAN5  = 5,
  STM32_PWM_CHAN6  = 6,
};

/* PWM timer channel output */

